src/cf/InformationRegisters/НастройкиПользователейТелефонии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПользователейТелефонии</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВнутреннийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсходящийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнутреннийИдентификаторВАТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиПользователейТелефонии/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает данные пользователя телефонии, записанные в регистре сведений НастройкиПользователейТелефонии
// 
// Параметры:
//  ВнутреннийИдентификаторВАТС - Строка - уникальный идентификатор абонента на стороне АТС
// 
// Возвращаемое значение:
//  Структура - Выборка - данные записанные в регистре сведений НастройкиПользователейТелефонии
//
Функция ПолучитьДанныеПользователя(ВнутреннийИдентификаторВАТС) Экспорт

	Запрос = Новый Запрос ("
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиПользователейТелефонии.Пользователь КАК Пользователь,
	|	НастройкиПользователейТелефонии.ВнутреннийНомер КАК ВнутреннийНомер,
	|	НастройкиПользователейТелефонии.ИсходящийНомер КАК ИсходящийНомер,
	|	НастройкиПользователейТелефонии.ВнутреннийИдентификаторВАТС КАК ВнутреннийИдентификаторВАТС
	|ИЗ
	|	РегистрСведений.НастройкиПользователейТелефонии КАК НастройкиПользователейТелефонии
	|ГДЕ
	|	НастройкиПользователейТелефонии.ВнутреннийИдентификаторВАТС = &ВнутреннийИдентификаторВАТС");
	
	Запрос.УстановитьПараметр("ВнутреннийИдентификаторВАТС", ВнутреннийИдентификаторВАТС);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка;

КонецФункции

// Возвращает данные пользователя телефонии, записанные в регистре сведений НастройкиПользователейТелефонии
// 
// Параметры:
//  ВнутреннийНомер - Строка - внутренний номер пользователя телефонии
// 
// Возвращаемое значение:
//  Структура - Выборка - данные записанные в регистре сведений НастройкиПользователейТелефонии
//
Функция НайтиПоВнутреннемуНомеру(ВнутреннийНомер) Экспорт

	Запрос = Новый Запрос ("
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиПользователейТелефонии.Пользователь КАК Пользователь,
	|	НастройкиПользователейТелефонии.ВнутреннийНомер КАК ВнутреннийНомер,
	|	НастройкиПользователейТелефонии.ИсходящийНомер КАК ИсходящийНомер,
	|	НастройкиПользователейТелефонии.ВнутреннийИдентификаторВАТС КАК ВнутреннийИдентификаторВАТС
	|ИЗ
	|	РегистрСведений.НастройкиПользователейТелефонии КАК НастройкиПользователейТелефонии
	|ГДЕ
	|	НастройкиПользователейТелефонии.ВнутреннийНомер = &ВнутреннийНомер");
	
	Запрос.УстановитьПараметр("ВнутреннийНомер", ВнутреннийНомер);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.ВнутреннийИдентификаторВАТС;

КонецФункции

#КонецОбласти

#КонецЕсли
